Documents/ВозвратТовараОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВозвратТовараОтПокупателя</Name>
			<Comment>Возврат проданного товара от покупателя</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусыКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусовКНачислениюПоДисконтнойКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчитыватьБонусы</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчетБонусовПоДисконтнымКартам</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйВидБонуснойСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБонусныхСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонусыКНачислению</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОпределенияСебестоимости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОпределенияСебестоимостиПоВозвратам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПродажи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СебестоимостьЗаЕдиницу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомпенсацияПоВозврату</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыКомпенсацииПоВозврату</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UDS_ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UDS_ИдентификаторОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗачетАванса</Name>
					<Comment>#12822</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЗаказам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВариантыКомпенсацииПоВозврату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыКомпенсацииПоВозврату</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗачестьВернуть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузитьПовторно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыБонусныхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыБонусныхСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Внутренняя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UDS</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОпределенияСебестоимостиПоВозвратам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыОпределенияСебестоимостиПоВозвратам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РучноеУказание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДокументуПродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВозвратТовараОтПокупателя/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПеременныеФормы

&НаКлиенте
Перем мПредыдущееКоличество;

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если Параметры.Ключ.Пустая() Тогда

	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	// бонусы
	УчетБонусовПо = ?(Объект.СлужебныйУчетБонусовПоДисконтнымКартам, 1, 0);
	Элементы.ГруппаБонусы.Видимость   = Объект.СлужебныйУчитыватьБонусы;
	Элементы.ГруппаДисконтнаяКарта.Видимость   = Объект.СлужебныйУчетБонусовПоДисконтнымКартам;
	Элементы.ТоварыБонусыКНачислению.Видимость = Объект.СлужебныйУчитыватьБонусы;
	
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);

	ФинансыСервер.УстановитьОтметкуНезаполненныхСтатейДоходовРасходов(Элементы);
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ТоварыСтатьяРасходов");
	ФинансыСервер.УстановитьВидимостьКолонокСтатейДиРВТабличнойЧасти(ЭтаФорма, МассивЭлементов, Истина);
		
	// Видимость колонки Артикул
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма);
	
	ЗаполнитьСтавкуНДСПоОрганизации(Ложь);
	РассчитатьИтоговыеПоказатели();
	
	ОбновитьДанныеТаблицыАвансов();
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);

	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//#13359 перенесено в ПослеЗаписи
	//Если НЕ Отказ 
	//	И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
	//	И UDS_ОбщийМодульВызовСервера.ИспользуетсяUDS() Тогда
	//	UDS_ОбщийМодульКлиент.ПередатьВозврат(Объект, Отказ);
	//КонецЕсли;
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//ВыполнитьПроверкиИЗадатьВопросыПередЗаписью(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
	ОбщийМодульКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РассчитатьИтоговыеПоказатели();
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = НЕ ПраваПользователей.РазрешеноПриходоватьНаСклад(Объект.Склад);
		Если Отказ Тогда
			Сообщить("У текущего пользователя нет прав для оформления прихода на склад """ + Объект.Склад + """");
			Возврат;
		КонецЕсли;
		
		// #14713 все строки с новыми заказами или строки с измененными значениями с заполненными заказами должны быть проверены на статус заказов
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
			Т1 = Объект.Ссылка.Товары.Выгрузить();
			Если НЕ Объект.Ссылка.Проведен Тогда
				// если документ не был проведен, то все позиции проверяем как "новые"
				Т1.Очистить();		
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура;
			Для каждого РеквизитТЧ из Метаданные.Документы.ВозвратТовараОтПокупателя.ТабличныеЧасти.Товары.Реквизиты Цикл
				СтруктураПоиска.Вставить(РеквизитТЧ.Имя);
			КонецЦикла;
			
			МассивЗаказовКПроверке = Новый Массив;
			Т2 = ТекущийОбъект.Товары.Выгрузить();
			Для каждого СтрокаТЗ из Т2 Цикл
				Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ЗаказПокупателя) ИЛИ НЕ СтрокаТЗ.КомпенсацияПоВозврату = Перечисления.ВариантыКомпенсацииПоВозврату.ОтгрузитьПовторно Тогда
					Продолжить;	
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЗ);
				НайденныеСтроки = Т1.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() = 0 Тогда
					МассивЗаказовКПроверке.Добавить(СтрокаТЗ.ЗаказПокупателя);	
				КонецЕсли;
			КонецЦикла;
			
			Если МассивЗаказовКПроверке.Количество() > 0 Тогда
				Запрос = Новый Запрос;	
				Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказовКПроверке);
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗаказПокупателя.Ссылка) КАК Заказ
				|ИЗ
				|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
				|ГДЕ
				|	ЗаказПокупателя.Ссылка В(&МассивЗаказов)
				|	И НЕ ЗаказПокупателя.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.ВРаботе)";
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("%1 не находится в статусе ""В работе"", проведение возврата отменено", Выборка.Заказ), , , , Отказ);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// проверяем заполненность статей доходов/расходов
	ФинансыСервер.ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	СуммаЗачета = ПолучитьСуммуЗачета();
	ФинансыСервер.ПроверитьСуммуРаспределенияПоТипамДокументов(Объект, "ЗачетАванса", СуммаЗачета, Отказ, ПараметрыЗаписи.РежимЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ОбновитьДанныеТаблицыАвансов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//#13359
		//Если UDS_ОбщийМодульВызовСервера.ИспользуетсяUDS() Тогда
		Если Объект.СлужебныйВидБонуснойСистемы = ПредопределенноеЗначение("Перечисление.ВидыБонусныхСистем.UDS") Тогда
			СостояниеОбменаUDS = UDS_ОбщийМодульКлиент.ПередатьВозврат(Объект);
			Если СостояниеОбменаUDS = 0 Тогда // не требуется
				// продолжаем процедуру ПослеЗаписи
			ИначеЕсли СостояниеОбменаUDS = 1 Тогда 
				// успешно отправлено
				Записать(ПараметрыЗаписи);
				Возврат;
			Иначе
				// ошибка при отправке, пользователь получит сообщение
				ПараметрыЗаписи.ПринудительноЗакрытьФорму = Ложь;
				//Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбщийМодульКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораНоменклатуры" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьСтатьюДоходовРасходовСервер();
	ЗаполнитьСтавкуНДСПоОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьСтатьюДоходовРасходовСервер();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	Объект.ДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговор;
КонецПроцедуры

&НаКлиенте
Процедура ДисконтнаяКартаПриИзменении(Элемент)
	РассчитатьИтоговыеПоказатели();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыТовары

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		Элемент.ТекущиеДанные.ДокументПродажи = ПредопределенноеЗначение("Документ.РеализацияТоваровИУслуг.ПустаяСсылка"); 
		Элемент.ТекущиеДанные.ЗаказПокупателя = ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка");
		Элемент.ТекущиеДанные.КомпенсацияПоВозврату = ПредопределенноеЗначение("Перечисление.ВариантыКомпенсацииПоВозврату.ПустаяСсылка");
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ВариантОпределенияСебестоимости = ПредопределенноеЗначение("Перечисление.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи");//nva
	КонецЕсли;
	
	Если НоваяСтрока И Не Копирование Тогда
        Элемент.ТекущиеДанные.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
	//++ №13299
	мПредыдущееКоличество = Элемент.ТекущиеДанные.Количество;
	//-- №13299
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И НЕ ОтменаРедактирования Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если НЕ ТекущиеДанные = Неопределено Тогда
			ТекущиеДанные.ВариантОпределенияСебестоимости = ПредопределенноеЗначение("Перечисление.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи");//nva
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьИтоговыеПоказатели();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	//++ №13812 пересчитаем скидку бонусами пропорционально
	Если НЕ мПредыдущееКоличество = Неопределено И мПредыдущееКоличество > 0 Тогда
		СтрокаТабличнойЧасти.БонусыКНачислению = (СтрокаТабличнойЧасти.БонусыКНачислению / мПредыдущееКоличество) * СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	//-- №13812
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена - СтрокаТабличнойЧасти.БонусыКНачислению;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	Элементы.Товары.ТекущиеДанные.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена - СтрокаТабличнойЧасти.БонусыКНачислению;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	СтрокаТабличнойЧасти.Цена = (СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.БонусыКНачислению) / СтрокаТабличнойЧасти.Количество;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
		
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтатьяРасходов");
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВариантОпределенияСебестоимостиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.СебестоимостьЗаЕдиницу = 0; // #12822
	ТекущиеДанные.ДокументПродажи = ПредопределенноеЗначение("Документ.РеализацияТоваровИУслуг.ПустаяСсылка"); // #12822
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСебестоимостьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументПродажи) Тогда
		ТекущиеДанные.СебестоимостьЗаЕдиницу = 0;
		Сообщить("Себестоимость будет определена по документу продажи!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДокументПродажиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДокументПродажи) Тогда
			ТекущаяСтрока.ВариантОпределенияСебестоимости = ПредопределенноеЗначение("Перечисление.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи");
			ТекущаяСтрока.СебестоимостьЗаЕдиницу = 0;
		Иначе
			ТекущаяСтрока.ВариантОпределенияСебестоимости = ПредопределенноеЗначение("Перечисление.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДокументПродажи) И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ЗаказПокупателя) Тогда
			СписокЗаказовПокупателей = Новый СписокЗначений;
			ПодготовитьСписокЗаказовПокупателей(Объект.Ссылка, ТекущаяСтрока.ДокументПродажи, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.СерияНоменклатуры, СписокЗаказовПокупателей);	
			Если СписокЗаказовПокупателей.Количество() > 0 Тогда
				ТекущаяСтрока.ЗаказПокупателя = СписокЗаказовПокупателей.Получить(0).Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказПокупателяПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если НЕ ТекущаяСтрока = Неопределено Тогда		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ДокументПродажи) И ЗначениеЗаполнено(ТекущаяСтрока.ЗаказПокупателя) Тогда			
			СписокРеализацийПоЗаказу = Новый СписокЗначений;
			ПодготовитьСписокРеализацийПоЗаказу(Объект.Ссылка, ТекущаяСтрока.ЗаказПокупателя, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.СерияНоменклатуры, СписокРеализацийПоЗаказу);	
			Если СписокРеализацийПоЗаказу.Количество() > 0 Тогда
				ТекущаяСтрока.ДокументПродажи = СписокРеализацийПоЗаказу.Получить(0).Значение;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ЗаказПокупателя) Тогда
			ТекущаяСтрока.КомпенсацияПоВозврату = ПолучитьСпособКомпенсации(); // №13856
		Иначе
			ТекущаяСтрока.КомпенсацияПоВозврату = ПредопределенноеЗначение("Перечисление.ВариантыКомпенсацииПоВозврату.ПустаяСсылка");	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДокументПродажиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ЗаказПокупателя) Тогда
		СтандартнаяОбработка = Ложь;
		СписокРеализацийПоЗаказу = Новый СписокЗначений;
		ПодготовитьСписокРеализацийПоЗаказу(Объект.Ссылка, ТекущаяСтрока.ЗаказПокупателя, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.СерияНоменклатуры, СписокРеализацийПоЗаказу);	
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", СписокРеализацийПоЗаказу);
		
		ОткрытьФорму("Документ.РеализацияТоваровИУслуг.ФормаВыбора", Новый Структура("Отбор, ТекущаяСтрока", Отбор, ТекущаяСтрока.ЗаказПокупателя), Элемент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказПокупателяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДокументПродажи) Тогда	
		СтандартнаяОбработка = Ложь;	
		СписокЗаказовПокупателей = Новый СписокЗначений;
		ПодготовитьСписокЗаказовПокупателей(Объект.Ссылка, ТекущаяСтрока.ДокументПродажи, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры, ТекущаяСтрока.СерияНоменклатуры, СписокЗаказовПокупателей);		
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", СписокЗаказовПокупателей);
		
		ОткрытьФорму("Документ.ЗаказПокупателя.ФормаВыбора", Новый Структура("Отбор, ТекущаяСтрока", Отбор, ТекущаяСтрока.ЗаказПокупателя), Элемент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыБонусыКНачислениюПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена - СтрокаТабличнойЧасти.БонусыКНачислению;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщийМодульКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщийМодульКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщийМодульКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКонтрагентаПоДисконтнойКарте(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияКонтрагентаПоДисконтноКарте", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ПолучитьКонтрагентаПоДисконтнойКарте",,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияКонтрагентаПоДисконтноКарте(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Контрагент = Результат.Контрагент;
	Объект.ДисконтнаяКарта = Результат.ДисконтнаяКарта;
		
	КонтрагентПриИзмененииНаСервере();
	РассчитатьИтоговыеПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Основание) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Основание документа не заполнено", , , "Объект.Основание");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ЗаполнитьПоОснованиюПослеВопроса", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещенияВопрос, "Табличная часть будет очищена и заполнена по основанию. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюПослеВопроса(Результат, Параметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоОснованиюНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОснованиюНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.Товары.Очистить();		
	ТекущийОбъект.ЗаполнитьТабличнуюЧастьПоОснованию(Объект.Основание);
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
	РассчитатьИтоговыеПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументыПродажиПоПоследнимПродажам(Команда)
	
	ТекстСообщения = "Будет выполнена процедура заполнения колонок ""Документ продажи"" и ""Заказ покупателя"" по позициям, где обе колонки не заполнены. Продолжить?";
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаЗаполнитьДокументыПродажиПоПоследнимПродажам", ЭтаФорма);
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаЗаполнитьДокументыПродажиПоПоследнимПродажам(Результат, ДополнительныеПараметры) Экспорт
	
    Если НЕ Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;
	ЗаполнитьДокументыПродажиПоПоследнимПродажамНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыПродажиПоПоследнимПродажамНаСервере()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.ЗаполнитьДокументыПродажиПоПоследнимПродажамНаСервере();
	
	ЗначениеВРеквизитФормы(РеквизитОбъект, "Объект");
	
	РассчитатьИтоговыеПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТовары(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата",					Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",			Объект.Организация);
	ПараметрыПодбора.Вставить("Склад",					Объект.Склад);
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыТовары());
	ПараметрыПодбора.Вставить("Валюта",					Объект.Валюта);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
	РассчитатьИтоговыеПоказатели();
	
КонецПроцедуры

&НаСервере
Функция ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);	
	Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область ВкладкаЗачетАванса

&НаКлиенте
Процедура Распределение_Документ(Команда)
	ФинансыКлиент.Распределение_Документ(Команда, ЭтаФорма, "ЗачетАванса");
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СуммаЗачета = ПолучитьСуммуЗачета();
	
	Для каждого ВыбранныйДокумент из ВыбранноеЗначение Цикл
		Если НЕ ВыбранныйДокумент.Пустая() Тогда
			НоваяСтрока = Объект.ЗачетАванса.Добавить();
			НоваяСтрока.Документ = ВыбранныйДокумент;
			НоваяСтрока.Сумма = СуммаЗачета;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		РаспределениеОплаты(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока Тогда
		ВыполнитьРаспределениеОплаты();
		ОбновитьДанныеТаблицыАвансов();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансаПослеУдаления(Элемент)
	
	ВыполнитьРаспределениеОплаты();
	ОбновитьДанныеТаблицыАвансов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансаСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ЗачетАванса.ТекущиеДанные;
	
	// №7373 нужно определить различие в валютах, чтобы корректно отображать определенные колонки и суммы
	ВалютаЗаказаРавнаВалютеДокумента = ОпределитьРазличиеВалютыЗаказаИВалютыДокументаНаСервере();
	
	Если НЕ (Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента) И НЕ ТекущаяСтрока = Неопределено Тогда
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьИзВалютыВВалютуВСтрокеТЧ(ТекущаяСтрока, Объект.Валюта, Объект.Дата);
	КонецЕсли;
	//ОбновитьНадписиРаспеределениеПлатежаНаСервере(ВалютаЗаказаРавнаВалютеДокумента);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуЗачета()
	
	//СуммаЗачета = 0;
	//Для каждого СтрокаТЧ из Объект.Товары Цикл
	//	Если СтрокаТЧ.КомпенсацияПоВозврату = ПредопределенноеЗначение("Перечисление.ВариантыКомпенсацииПоВозврату.ЗачестьВернуть") Тогда
	//		СуммаЗачета = СуммаЗачета + СтрокаТЧ.Сумма;	
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Возврат СуммаЗачета;
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ДокОбъект.ПолучитьСуммуЗачета();
	
КонецФункции

&НаКлиенте
Процедура РаспределениеОплаты(Команда)
	
	ВыполнитьРаспределениеОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРаспределениеОплаты(ДополнительныеПараметры=Неопределено)

	ОчиститьСообщения();
	СуммаЗачета = ПолучитьСуммуЗачета();
	Если СуммаЗачета = 0 Тогда
		Сообщить("Нет суммы к распределению! Сумма формируется по строкам с видом компенсации ""Зачесть как аванс / вернуть оплату""");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияОбновитьДанные = Новый ОписаниеОповещения("ОписаниеОповещенияОбновитьДанные", ЭтотОбъект);
	ФинансыКлиент.РаспределениеОплаты(ЭтаФорма, "ЗачетАванса", СтрокиРаспределенияПлатежей(), СуммаЗачета, ОписаниеОповещенияОбновитьДанные);
	
КонецПроцедуры

&НаСервере
Функция СтрокиРаспределенияПлатежей()
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Объект.ЗачетАванса.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ОписаниеОповещенияОбновитьДанные(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьДанныеТаблицыАвансов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеТаблицыАвансов()
	
	СписокДокументовРаспределения = Объект.ЗачетАванса.Выгрузить(,"Документ");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыПоЗаказамОстатки.СуммаОстаток КАК ОсталосьРаспределить,
	|	РасчетыПоЗаказамОстатки.Заказ КАК Заказ,
	|	РасчетыПоЗаказамОстатки.Заказ.СуммаДокумента КАК СуммаДокумента,
	|	РасчетыПоЗаказамОстатки.Заказ.Валюта КАК Валюта
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Остатки(, Заказ В (&Заказ)) КАК РасчетыПоЗаказамОстатки";
	Запрос.УстановитьПараметр("Заказ", СписокДокументовРаспределения);
	ТаблицаПоДокументам = Запрос.Выполнить().Выгрузить();
	
	// №7373 нужно определить различие в валютах, чтобы корректно отображать определенные колонки и суммы
	ВалютаЗаказаРавнаВалютеДокумента = ФинансыСервер.ОпределитьРазличиеВалютыЗаказаИВалютыДокумента(Объект, "ЗачетАванса");
	
	Для Каждого СтрокаРаспределения Из Объект.ЗачетАванса Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Заказ", СтрокаРаспределения.Документ);
		НайденныеСтроки = ТаблицаПоДокументам.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента Тогда 
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, НайденныеСтроки[0]);
				СтрокаРаспределения.ВалютаДокумента = НайденныеСтроки[0].Валюта;
			Иначе
				СтрокаРаспределения.ВалютаДокумента = НайденныеСтроки[0].Валюта; 
				СтрокаРаспределения.СуммаДокументаВВалютеДокумента = НайденныеСтроки[0].СуммаДокумента;
				СтрокаРаспределения.СуммаДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(НайденныеСтроки[0].Валюта, Объект.Валюта, Объект.Дата, НайденныеСтроки[0].СуммаДокумента);
				СтрокаРаспределения.ОсталосьРаспределить = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(НайденныеСтроки[0].Валюта, Объект.Валюта, Объект.Дата, НайденныеСтроки[0].ОсталосьРаспределить);
			КонецЕсли;
		Иначе
			Попытка
				Если Объект.Валюта = ВалютаУчета И ВалютаЗаказаРавнаВалютеДокумента Тогда
					СтрокаРаспределения.СуммаДокумента = СтрокаРаспределения.Документ.СуммаДокумента;
					СтрокаРаспределения.ВалютаДокумента = СтрокаРаспределения.Документ.Валюта;
				Иначе
					СтрокаРаспределения.ВалютаДокумента = СтрокаРаспределения.Документ.Валюта; 
					СтрокаРаспределения.СуммаДокументаВВалютеДокумента = СтрокаРаспределения.Документ.СуммаДокумента;
					СтрокаРаспределения.СуммаДокумента = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(СтрокаРаспределения.Документ.Валюта, Объект.Валюта, Объект.Дата, СтрокаРаспределения.Документ.СуммаДокумента);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ФинансыСервер.ОбновитьНадписиРаспеределениеПлатежа(ЭтаФорма, Объект, "ЗачетАванса", ВалютаУчета, ВалютаЗаказаРавнаВалютеДокумента);
	
КонецПроцедуры

#КонецОбласти
	
#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	// #12822
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСебестоимость.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияСебестоимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи;

	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "заполнение не требуется");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	// #12822
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыДокументПродажи.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияСебестоимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание;

	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "заполнение не требуется");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	// #12822 подсказка ввода не используется
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСебестоимость.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияСебестоимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СебестоимостьЗаЕдиницу");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Укажите цену");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	// #12822 подсказка ввода отображается только при входе в поле 
	//Укажите документ продажи
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыДокументПродажи.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВариантОпределенияСебестоимости");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ДокументПродажи");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Укажите документ продажи");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

	// #12822
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКомпенсацияПоВозврату.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ЗаказПокупателя");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "заполнение не требуется");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщийМодульКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьюДоходовРасходовСервер()
	Объект.СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(Объект, , Ложь);
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтоговыеПоказатели()
	
	СуммаДокументаВрем = Объект.Товары.Итог("Сумма");
	Если НЕ Объект.СуммаДокумента = СуммаДокументаВрем Тогда
		Объект.СуммаДокумента = СуммаДокументаВрем;
	КонецЕсли;
	
	СуммаНДС = Объект.Товары.Итог("СуммаНДС");
	
	Если Объект.СлужебныйУчитыватьБонусы Тогда		
		//ОпределитьОстатокПоДисконтнойКарте();
		БонусыСервер.ОпределитьОстатокПоДисконтнойКарте(ЭтаФорма);
		БонусыКНачислениюИтог = Объект.Товары.Итог("БонусыКНачислению");
		Если Не Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = БонусыКНачислениюИтог Тогда
			Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = БонусыКНачислениюИтог;
		КонецЕсли;
	Иначе
		//Если НЕ Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = 0 Тогда
		Объект.СуммаБонусовКНачислениюПоДисконтнойКарте = 0;
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСПоОрганизации(ИзменятьСтавку = Истина)
	
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Объект.Организация);
	СтавкаНДСПоУмолчанию = УчетНДС.СтавкаНДСПоУмолчанию(Объект.Организация);
	
	Элементы.ТоварыСуммаНДС.Видимость 	= УчитыватьНДС;
	Элементы.ТоварыСтавкаНДС.Видимость 	= УчитыватьНДС;
	
	Если ИзменятьСтавку Тогда
		Для каждого СтрокаТабличнойЧасти из Объект.Товары Цикл
			СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
			ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);	
		КонецЦикла;
		РассчитатьИтоговыеПоказатели();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ОпределитьРазличиеВалютыЗаказаИВалютыДокументаНаСервере()
	
	Возврат ФинансыСервер.ОпределитьРазличиеВалютыЗаказаИВалютыДокумента(Объект, "ЗачетАванса");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСпособКомпенсации()
	
	Возврат ОбщийМодульСервер.ПолучитьСпособКомпенсацииПоВозвратуТоваровОтПокупателя();
	
КонецФункции

&НаСервере
Функция ПолучитьСписокВидовНоменклатурыТовары()
	
	Возврат Справочники.Номенклатура.ПолучитьСписокВидовНоменклатурыТовары();
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПодготовитьСписокЗаказовПокупателей(ВозвратСсылка, ДокументПродажи, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, СписокЗаказовПокупателей) 
			
	МассивЗаказов = ОбщийМодульСервер.МассивЗаказовПоРеализациям(ВозвратСсылка, ДокументПродажи, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры);	
	СписокЗаказовПокупателей.ЗагрузитьЗначения(МассивЗаказов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьСписокРеализацийПоЗаказу(ВозвратСсылка, ЗаказПокупателя, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, СписокРеализацийПоЗаказу) 
	
	МассивРеализаций = ОбщийМодульСервер.МассивРеализацийПоЗаказуИНоменклатуре(ВозвратСсылка, ЗаказПокупателя, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры);	
	СписокРеализацийПоЗаказу.ЗагрузитьЗначения(МассивРеализаций);
	
КонецПроцедуры

#КонецОбласти
